#+title: Todos 42

* Projects [3/5]
:PROPERTIES:
:COLUMNS:  %40ITEM(Task) %17EFFORT(Estimated Effort){:} %CLOCKSUM(Time spent)
:Effort_ALL: 0:15 0:30 0:45 1:00 2:00 3:00 4:00 5:00 6:00 7:00 8:00 9:00 10:00 11:00 12:00 13:00 14:00 15:00 16:00 17:00 18:00 19:00 20:00 21:00 22:00 23:00 24:00 25:00 26:00 27:00 28:00 29:00 30:00 31:00 32:00 33:00 34:00 35:00 36:00 37:00 38:00 39:00 40:00 41:00 42:00 43:00 44:00 45:00 46:00 47:00 48:00 49:00 50:00 51:00 52:00 53:00 54:00 55:00 56:00 57:00 58:00 59:00 60:00 61:00 62:00 63:00 64:00 65:00 66:00 67:00 68:00 69:00 70:00 71:00 72:00 73:00 74:00 75:00 76:00 77:00 78:00 79:00 80:00 81:00 82:00 83:00 84:00 85:00 86:00 87:00 88:00 89:00 90:00 91:00 92:00 93:00 94:00 95:00 96:00 97:00 98:00 99:00 100:00
:END:
** DONE ft_printf
CLOSED: [2024-02-20 Tue 18:00]
:PROPERTIES:
:COLUMNS:  %40ITEM(Task) %17EFFORT(Estimated Effort){:} %CLOCKSUM(Time spent)
:Effort_ALL: 0:15 0:30 0:45 1:00 2:00 3:00 4:00 5:00 6:00 7:00 8:00 9:00 10:00 11:00 12:00 13:00 14:00 15:00 16:00 17:00 18:00 19:00 20:00 21:00 22:00 23:00 24:00 25:00 26:00 27:00 28:00 29:00 30:00 31:00 32:00 33:00 34:00 35:00 36:00 37:00 38:00 39:00 40:00 41:00 42:00 43:00 44:00 45:00 46:00 47:00 48:00 49:00 50:00 51:00 52:00 53:00 54:00 55:00 56:00 57:00 58:00 59:00 60:00 61:00 62:00 63:00 64:00 65:00 66:00 67:00 68:00 69:00 70:00 71:00 72:00 73:00 74:00 75:00 76:00 77:00 78:00 79:00 80:00 81:00 82:00 83:00 84:00 85:00 86:00 87:00 88:00 89:00 90:00 91:00 92:00 93:00 94:00 95:00 96:00 97:00 98:00 99:00 100:00
:END:
*** ABORTED printf-breaker
:PROPERTIES:
:Effort:   5:00
:END:
:LOGBOOK:
CLOCK: [2024-02-16 Fri 17:28]--[2024-02-16 Fri 17:37] =>  0:09
CLOCK: [2024-02-07 Wed 03:20]--[2024-02-07 Wed 03:55] =>  0:35
CLOCK: [2024-02-07 Wed 02:11]--[2024-02-07 Wed 02:27] =>  0:16
CLOCK: [2024-02-07 Wed 00:18]--[2024-02-07 Wed 01:22] =>  1:04
CLOCK: [2024-02-06 Tue 22:37]--[2024-02-07 Wed 00:18] =>  1:41
CLOCK: [2024-02-06 Tue 14:40]--[2024-02-06 Tue 14:58] =>  0:18
CLOCK: [2024-02-06 Tue 10:26]--[2024-02-06 Tue 12:09] =>  1:43
CLOCK: [2024-02-06 Tue 09:53]--[2024-02-06 Tue 09:55] =>  0:02
CLOCK: [2024-02-06 Tue 09:32]--[2024-02-06 Tue 09:47] =>  0:15
CLOCK: [2024-02-06 Tue 09:22]--[2024-02-06 Tue 09:28] =>  0:06
CLOCK: [2024-02-06 Tue 08:42]--[2024-02-06 Tue 09:16] =>  0:34
CLOCK: [2024-02-02 Fri 18:10]--[2024-02-02 Fri 19:00] =>  0:50
CLOCK: [2024-02-02 Fri 17:27]--[2024-02-02 Fri 17:45] =>  0:18
CLOCK: [2024-02-02 Fri 14:42]--[2024-02-02 Fri 15:24] =>  0:42
CLOCK: [2024-02-02 Fri 13:07]--[2024-02-02 Fri 13:16] =>  0:09
CLOCK: [2024-02-02 Fri 11:24]--[2024-02-02 Fri 12:52] =>  1:28
CLOCK: [2024-02-02 Fri 10:28]--[2024-02-02 Fri 11:24] =>  0:56
:END:
*** DONE ft_printf code
CLOSED: [2024-02-20 Tue 18:00]
:PROPERTIES:
:EFFORT:   15:00
:END:
:LOGBOOK:
CLOCK: [2024-02-17 Sat 03:32]--[2024-02-17 Sat 07:10] =>  3:38
CLOCK: [2024-02-17 Sat 02:49]--[2024-02-17 Sat 03:13] =>  0:24
CLOCK: [2024-02-17 Sat 01:54]--[2024-02-17 Sat 02:45] =>  0:51
CLOCK: [2024-02-17 Sat 01:34]--[2024-02-17 Sat 01:52] =>  0:18
CLOCK: [2024-02-17 Sat 00:57]--[2024-02-17 Sat 01:03] =>  0:06
CLOCK: [2024-02-17 Sat 00:30]--[2024-02-17 Sat 00:41] =>  0:11
CLOCK: [2024-02-17 Sat 00:17]--[2024-02-17 Sat 00:29] =>  0:12
CLOCK: [2024-02-16 Fri 23:14]--[2024-02-17 Sat 00:11] =>  0:57
CLOCK: [2024-02-16 Fri 21:54]--[2024-02-16 Fri 23:11] =>  1:17
CLOCK: [2024-02-16 Fri 19:00]--[2024-02-16 Fri 19:29] =>  0:29
CLOCK: [2024-02-16 Fri 17:53]--[2024-02-16 Fri 18:55] =>  1:02
CLOCK: [2024-02-16 Fri 15:59]--[2024-02-16 Fri 17:27] =>  1:28
CLOCK: [2024-02-16 Fri 14:57]--[2024-02-16 Fri 15:56] =>  0:59
CLOCK: [2024-02-16 Fri 12:09]--[2024-02-16 Fri 13:49] =>  1:40
CLOCK: [2024-02-16 Fri 11:47]--[2024-02-16 Fri 12:09] =>  0:22
CLOCK: [2024-02-16 Fri 10:20]--[2024-02-16 Fri 11:40] =>  1:20
CLOCK: [2024-02-15 Thu 19:30]--[2024-02-15 Thu 20:19] =>  0:49
CLOCK: [2024-02-15 Thu 17:35]--[2024-02-15 Thu 19:04] =>  1:29
CLOCK: [2024-02-14 Wed 06:29]--[2024-02-14 Wed 07:15] =>  0:46
CLOCK: [2024-02-14 Wed 05:36]--[2024-02-14 Wed 05:47] =>  0:11
CLOCK: [2024-02-14 Wed 04:41]--[2024-02-14 Wed 05:25] =>  0:44
CLOCK: [2024-02-14 Wed 00:17]--[2024-02-14 Wed 00:40] =>  0:23
CLOCK: [2024-02-13 Tue 23:46]--[2024-02-13 Tue 23:47] =>  0:01
CLOCK: [2024-02-13 Tue 21:05]--[2024-02-13 Tue 21:31] =>  0:26
CLOCK: [2024-02-13 Tue 17:00]--[2024-02-13 Tue 17:13] =>  0:13
CLOCK: [2024-02-13 Tue 14:58]--[2024-02-13 Tue 16:15] =>  1:17
CLOCK: [2024-02-13 Tue 03:26]--[2024-02-13 Tue 04:49] =>  1:23
CLOCK: [2024-02-13 Tue 02:17]--[2024-02-13 Tue 02:50] =>  0:33
CLOCK: [2024-02-13 Tue 01:40]--[2024-02-13 Tue 02:08] =>  0:28
CLOCK: [2024-02-12 Mon 14:26]--[2024-02-12 Mon 15:04] =>  0:38
CLOCK: [2024-02-12 Mon 12:57]--[2024-02-12 Mon 14:03] =>  1:06
CLOCK: [2024-02-09 Fri 18:57]--[2024-02-09 Fri 19:33] =>  0:36
CLOCK: [2024-02-09 Fri 07:48]--[2024-02-09 Fri 08:13] =>  0:25
CLOCK: [2024-02-09 Fri 02:11]--[2024-02-09 Fri 07:24] =>  5:13
CLOCK: [2024-02-08 Thu 16:37]--[2024-02-08 Thu 18:47] =>  2:10
CLOCK: [2024-02-08 Thu 16:35]--[2024-02-08 Thu 16:36] =>  0:01
:END:

** DONE get_next_line
CLOSED: [2024-02-23 Fri 17:00] DEADLINE: <2024-02-16 Fri>
** DONE push_swap
CLOSED: [2024-05-17 Fri 19:15] DEADLINE: <2024-03-15 Fri>
** IN PROGRESS FdF
** TODO pipex
* Side projects
* Miscellaneous
